Autodesk.Revit.DB.VerticalTextAlignment
Since:
2016
Supported kinds of text vertical alignment within the text containing box.
Since:
2016

Autodesk.Revit.DB.VerticalTextAlignment.Middle
Text is vertically centered within the text box.

Autodesk.Revit.DB.VerticalTextAlignment.Bottom
Text is aligned with the bottom side of the text box.

Autodesk.Revit.DB.VerticalTextAlignment.Top
Text is aligned with the top side of the text box.